
&НаКлиенте
Процедура РассчитатьТаблицуПлатежей(Команда)
	
	Объект.ТаблицаПлатежей.Очистить();
	
	ДатаПредыдущегоПлатежа = Объект.ДатаВыдачиКредита;
	СуммаПредыдущегоПлатежа = Объект.НачальнаяСуммаПлатежа;
	ПолнаяСтоимостьКредитаНаТекущийМомент = 0;
	ПолнаяСтоимостьКредитаВсего = 0;

	Для Счетчик = 1 По Объект.СрокКредитаМесяцы Цикл
		Строка = Объект.ТаблицаПлатежей.Добавить();
		Строка.ДатаПлатежа = ДобавитьМесяц(ДатаПредыдущегоПлатежа, 1);
		ДатаПредыдущегоПлатежа = Строка.ДатаПлатежа;
		Строка.СуммаПлатежа = СуммаПредыдущегоПлатежа;
		СуммаПредыдущегоПлатежа = Строка.СуммаПлатежа;
		Если ТекущаяДата() > Строка.ДатаПлатежа Тогда
	    	ПолнаяСтоимостьКредитаНаТекущийМомент = ПолнаяСтоимостьКредитаНаТекущийМомент + Строка.СуммаПлатежа;
			Строка.ПлатежВыполнен = Истина;
		КонецЕсли;
		ПолнаяСтоимостьКредитаВсего = ПолнаяСтоимостьКредитаВсего + Строка.СуммаПлатежа;	
	КонецЦикла;	
	
	Объект.ПолнаяСтоимостьКредитаНаТекущийМомент = ПолнаяСтоимостьКредитаНаТекущийМомент;
	Объект.ПолнаяСтоимостьКредитаВсего = ПолнаяСтоимостьКредитаВсего;

КонецПроцедуры

&НаСервере
Процедура РассчитатьТаблицуПлатежейНаСервере()	
	
		
КонецПроцедуры
