
&НаКлиенте
Процедура РазделитьПоТоварамПриИзменении(Элемент)
	
	Если Объект.РасшифровкаПокупки.Количество() > 0 Тогда
		Ответ = Вопрос("Таблица товаров будет очищена. Ок?", РежимДиалогаВопрос.ОКОтмена,,"Ок",,);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			Объект.РасшифровкаПокупки.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Элементы.РасшифровкаПокупки.Видимость = Объект.РазделитьПоТоварам;
	Элементы.Сумма.Видимость = НЕ Объект.РазделитьПоТоварам;
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.РасшифровкаПокупки.Видимость = Объект.РазделитьПоТоварам;
	Элементы.Сумма.Видимость = НЕ Объект.РазделитьПоТоварам;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПокупкиЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПокупкиКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВСтроке()
	
	ТекущиеДанные = Элементы.РасшифровкаПокупки.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	Объект.Сумма = Объект.РасшифровкаПокупки.Итог("Сумма");
	
КонецПроцедуры


&НаКлиенте
Процедура РасшифровкаПокупкиСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПокупки.ТекущиеДанные;
	
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
	ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
	Объект.Сумма = Объект.РасшифровкаПокупки.Итог("Сумма");
	
КонецПроцедуры

