Функция СуммаВРублях(СуммаВВалюте, Валюта, ДатаКурса) Экспорт
	
	СуммаВРублях = 0;
	
	// 1. Обработать случа когда Валюта - Российский рубль
	
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
		Возврат СуммаВВалюте;	
	КонецЕсли;
	
	// 2. Получить курс валюты.
	
	Отбор = Новый Структура;
	Отбор.Вставить("Валюта", Валюта);
	ДанныеОКурсе = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Отбор);
	
	// 3. Рассчитать сумму в рублях по курсу
	
	Если ЗначениеЗаполнено(ДанныеОКурсе) Тогда	
		СуммаВРублях = СуммаВВалюте * ДанныеОКурсе.Курс / ДанныеОКурсе.Кратность;
	Иначе
	КонецЕсли;
	
	Возврат	СуммаВРублях;
	
КонецФункции

Функция СуммаВВалюте(СуммаВРублях, Валюта, ДатаКурса) Экспорт
	
	СуммаВВалюте = 0;
	
	// 1. Обработать случа когда Валюта - Российский рубль
	
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
		Возврат СуммаВРублях;	
	КонецЕсли;
	
	// 2. Получить курс валюты.
	
	//Отбор = Новый Структура;
	//Отбор.Вставить("Валюта", Валюта);
	//ДанныеОКурсе = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Отбор);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаКурса", ДатаКурса);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Результат = Запрос.Выполнить();
	
	
	
	Если Результат.Пустой() Тогда
				
	Иначе
		ДанныеОКурсе = Результат.Выбрать();
		ДанныеОКурсе.Следующий();
		
		// 3. Рассчитать сумму в рублях по курсу
		СуммаВВалюте = СуммаВРублях / ДанныеОКурсе.Курс * ДанныеОКурсе.Кратность;
	КонецЕсли;
	
	Возврат	СуммаВВалюте;
	
КонецФункции