
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СуммаВРублях = РегистрыСведений.КурсыВалют.СуммаВРублях(Сумма, СчетСписания.Валюта, Дата);
    
	// регистр ЛичныеСчета Расход
	Движения.ЛичныеСчета.Записывать = Истина;
	Движение = Движения.ЛичныеСчета.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Валюта = СчетСписания.Валюта;
	Движение.Счет = СчетСписания;
	Движение.Сумма = СуммаВРублях;
	Движение.СуммаВалютная = Сумма;

	СуммаВВалюте = РегистрыСведений.КурсыВалют.СуммаВВалюте(СуммаВРублях, СчетЗачисления.Валюта, Дата);
	
	// регистр ЛичныеСчета Приход
	Движения.ЛичныеСчета.Записывать = Истина;
	Движение = Движения.ЛичныеСчета.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Валюта = СчетЗачисления.Валюта;
	Движение.Счет = СчетЗачисления;
	Движение.Сумма = СуммаВРублях;
	Движение.СуммаВалютная = СуммаВВалюте;

КонецПроцедуры
